app/Observers/ReplyObserver.php

update `topics` set `reply_count` = `reply_count` + 1, `updated_at` = '2018-02-27 07:14:19' where `id` = '101'
---
    public function created(Reply $reply)
    {
		$topic = $reply->topic;
		$topic->increment('reply_count', 1);

update `topics` set `reply_count` = `reply_count` - 1, `updated_at` = '2018-03-01 12:26:21' where `id` = '101'
---
    public function deleted(Reply $reply)
    {
        $reply->topic->decrement('reply_count', 1);