app/Http/Controllers/RepliesController.php

	public function store(ReplyRequest $request,Reply $reply)
	{
		$reply->content = $request->content;
		$reply->user_id = Auth::id();
        $reply->topic_id = $request->topic_id;
        $reply->save();

        return redirect()->to($reply->topic->link())->with('success', '创建成功！');
---
insert into `replies` (`content`, `user_id`, `topic_id`, `updated_at`, `created_at`) values ('WOW!', '12', '101', '2018-02-27 07:14:19', '2018-02-27 07:14:19')
select * from `topics` where `topics`.`id` = '101' limit 1

	public function destroy(Reply $reply)
	{
		$this->authorize('destroy', $reply);
		$reply->delete();
---
delete from `replies` where `id` = '1004'