app/Http/Controllers/TopicsController.php

	public function create(Topic $topic)
	{
		$categories = Category::all();
---
select * from `categories`

	public function store(TopicRequest $request,Topic $topic)
	{
		//store() 方法的第二个参数，会创建一个空白的 $topic 实例；
		//$topic->fill($request->all()); fill 方法会将传参的键值数组填充到模型的属性中
        $topic->fill($request->all());
        $topic->user_id = Auth::id();
        //存储到数据库
        $topic->save();
---
insert into `topics` (`title`, `category_id`, `body`, `user_id`, `excerpt`, `updated_at`, `created_at`) values ('kaka', '1', '<p>haha!</p>', '11', 'haha!', '2018-02-27 05:19:03', '2018-02-27 05:19:03')