app/Http/Controllers/UsersController.php

    public function update(UserRequest $request, ImageUploadHandler $uploader, User $user)
    {
    	//update 是指授权类里的 update 授权方法，$user 对应传参 update 授权方法的第二个参数。调用时，默认情况下，我们 不需要 传递第一个参数，也就是当前登录用户至该方法内，因为框架会 自动 加载当前登录用户
    	$this->authorize('update', $user);
        $data = $request->all();

        if ($request->avatar) {
           $result = $uploader->save($request->avatar, 'avatars', $user->id, 362);
            //if ($result) 的判断是因为 ImageUploadHandler 对文件后缀名做了限定，不允许的情况下将返回 false：
            if ($result) {
                $data['avatar'] = $result['path'];
            }
        }

        $user->update($data);
---
update `users` set `updated_at` = '2018-02-27 07:15:22', `avatar` = 'http://larabbs.test/uploads/images/avatars/201802/27//12_1519686919_oitEnKeAvJ.jpg' where `id` = '12'