app/Models/User.php

update `users` set `notification_count` = `notification_count` + 1, `updated_at` = '2018-02-27 08:47:56' where `id` = '11'
---
     public function notify($instance)
    {
        // 如果要通知的人是当前用户，就不必通知了！
        if ($this->id == Auth::id()) {
            return;
        }
        $this->increment('notification_count');

update `users` set `updated_at` = '2018-03-01 12:45:34', `notification_count` = '0' where `id` = '11'
---
    public function markAsRead()
    {
        $this->notification_count = 0;
        $this->save();